<template>
    <div id="news">
        <b-container>
            <h2>Новости</h2>
            <b-tabs  pills fill>
                <b-tab  :title='2019'>
                    <b-row v-for="(news, index) in News2019" :key="index">
                        <b-col cols="2">
                            <div class="number">{{news.number}}</div>
                            <div class="year_news">{{news.year_news}}</div>
                        </b-col>
                        <b-col>
                            <h3>{{news.name_news}}</h3>
                            <div class="text_news">{{news.descr_news}}</div>
                        </b-col>
                    </b-row>
                </b-tab>
                <b-tab  :title='2018'>
                    <b-row v-for="(news, index) in News2018" :key="index">
                        <b-col cols="2">
                            <div class="number">{{news.number}}</div>
                            <div class="year_news">{{news.year_news}}</div>
                        </b-col>
                        <b-col>
                            <h3>{{news.name_news}}</h3>
                            <div class="text_news">{{news.descr_news}}</div>
                        </b-col>
                    </b-row>
                </b-tab>
                <b-tab  :title='2017'>
                    <b-row v-for="(news, index) in News2017" :key="index">
                        <b-col cols="2">
                            <div class="number">{{news.number}}</div>
                            <div class="year_news">{{news.year_news}}</div>
                        </b-col>
                        <b-col>
                            <h3>{{news.name_news}}</h3>
                            <div class="text_news">{{news.descr_news}}</div>
                        </b-col>
                    </b-row>
                </b-tab>
            </b-tabs>
        </b-container>
    </div>
</template>

<script>

    export default {
        name: "news",
        data() {
            return {
                News2019:[
                    {
                        number: 10,
                        year_news: 'июля 2019',
                        name_news:'Получено свидетельство о квалификации № ЭС 01.101.0562-2019',
                        descr_news:'Центральным органом Системы "ЭЛЕКТРОНСЕРТ" выдано Свидетельство о квалификации № ЭС 01.101.0562-2019',
                    },
                    {
                        number: 29,
                        year_news: 'апреля 2019',
                        name_news:'Выдан сертификат соответствия № ВР 22.1.13549-2019',
                        descr_news:'Органом по сертификации системы менеджмента качества ООО «МОСКОВСКАЯ РАДИОЭЛЕКТРОННАЯ КОМПАНИЯ» проведен инспекционный аудит системы менеджмента качества ООО «Компания Промэлектронсервис» применительно к производству и разработки продукции по заявленным кодамЕК 001 на соответствие требованиям ГОСТ Р ИСО 9001-2015, ГОСТ РВ 0015-002-2012.По результатам инспекционного контроля установлено: - показатели результативности процессов и СМК, показатели качества приразработке и производстве изделий, а так же динамика показателей отвечает установленным требованиям; - в организации внедренынеобходимые для выполнения работ в заявленной области государственные и государственные военные стандарты; - организация обладаетнеобходимым оборудованием и персоналом для проведения работ в заявленной области в интересах Министерства Обороны по заказам сторонних организаций.Комиссией принято решение о переоформлении, в связи с изменением юридического адреса, сертификата соответствия со сроком действия до 11 мая 2020 года.',
                    },
                    {
                        number: 26,
                        year_news: 'апреля 2019',
                        name_news:'Получен сертификат соответствия № ЭС 02.094.0227-2019',
                        descr_news:'Органом по сертификации системы менеджмента качества АНО «Центр испытаний и сертификации «Промтехносерт» проведена работа по ресертификации система менеджмента качества ООО «Компания Промэлектронсервис». По результатам проверки установлено: - нарушение применений Знака соответствия СМК не выявлено; - система менеджмента качества ООО «Компания Промэлектронсервис» соответствует требованиям ГОСТ Р ИСО9001-2015, ГОСТ РВ 0015-002-2012, ЭС РД 009-2014, ЭС РД 010-2015 применительно к закупке, хранению и поставке ЭКБ ОП и ЭКБ ИП; - в ООО«Компания Промэлектронсервис» внедрена СМК, которая обеспечивает надлежащее качество и стабильность поставки ЭКБ отечественногои иностранного производства; - в организации постоянно проводится работа по улучшению процессов и эффективностифункционирования СМК путем осуществления мониторинга, измерения, изучения записей, самооценки и анализа со стороны руководства.',
                    },
                    {
                        number: 8,
                        year_news: 'апреля 2019',
                        name_news:'Сертификат № ФСС КТ 134.01.3.1.000000.25.19 от 04.04.2019г. на срок до 04.04.2022г',
                        descr_news:'ООО «Компания Промэлектронсервис» в очередной раз подтвердила свою компетентность и получила сертификат об успешном завершении проверки системы менеджмента качества на соответствие требованиям Положения РК-11-КТ,ГОСТ Р ИСО 9001-2015, дополнительным требованиям ГОСТ РВ 0015-002-2012 и ОСТ 134-1028-2012 с изм. 1 применительно к закупке,хранению, сертификационным испытаниям и поставке групп продукции изделий ракетно-космической техникив Федеральной системе сертификации космической техники (Сертификат № ФСС КТ 134.01.3.1.000000.25.19 от 04.04.2019г. на срок до 04.04.2022г.).',
                    },
                ],
                News2018:[
                    {
                        number: 1,
                        year_news: 'октября 2018',
                        name_news:'Получено свидетельство о квалификации № ЭС 01.101.0455-2018 от 28.09.2018г.',
                        descr_news:'ООО «Компания Промэлектронсервис» успешно прошла проверку системы менеджмента качества Квалифицированного поставщика Центральным органом Системы «Электронсерт» (Свидетельство о Квалификации № ЭС 01.101.0455-2018 от 28.09.2018г. на срок до 28.09.2020г.)с расширением области поставок ЭКБ отечественного и иностранного производства ЭКБ, КИ и материалы иностранного производства:(ЕКПС 5963, 5962, 5961, 5980, 5955, 5905, 5910, 5950, 5945, 5935, 5963, 6130, 6145, 5953, 5970) ЭКБ, КИ и материалыотечественного производства (ЕКПС 5960, 5963, 5962, 5961, 5980, 5955, 5905, 5910, 5950, 5945, 5920, 5999, 5935, 5990, 6145, 5963, 6130, 5963, 5998, 5970)',
                    },
                    {
                        number: 29,
                        year_news: 'мая 2018',
                        name_news:'Испытательная лаборатория ООО «Компания Промэлектронсервис» успешно прошла инспекционный контроль Центральным органом Системы «Электронсерт»',
                        descr_news:'Испытательная лаборатория ООО «Компания Промэлектронсервис» успешно прошла инспекционный контроль Центральным органом Системы «Электронсерт» (Аттестат аккредитации № ЭС 01.061.0033-2017 от 06.03.2017г.) с расширением области аккредитации на право проведенияиспытаний: - Электрических и электронных принадлежностей, печатных плат, соединительных проводов и комплектующих изделий к ним.Для изделий отечественного и иностранного производства (ЕКПС 5998); - Электронных модулей, с рабочим диапазоном частот до 20 ГГц.Для изделий отечественного и иностранного производства (ЕКПС 5963). За период с момента получения аккредитации на техническую компетентностьи независимость. Испытательная лаборатория ООО «Компания Промэлектронсервис» дополнительно приобрела 3 единицы испытательного оборудования, а также 31 единицу средств измерений.',
                    },
                    {
                        number: 30,
                        year_news: 'апреля 2018',
                        name_news:'Специалисты Испытательной лаборатории ООО «Компания Промэлектронсервис» прошли обучение в Центре подготовки и развития персонала АНО «Военный Регистр»',
                        descr_news:'Специалисты Испытательной лаборатории ООО «Компания Промэлектронсервис» 11 апреля 2018 года прошли обучение в Центре подготовки и развития персонала АНО «Военный Регистр» по программе «Организация и проведение входного контроля на основе требований ГОСТ РВ 0015-308-2017» и получили сертификаты,подтверждающие успешное окончание обучения».',
                    },
                    {
                        number: 30,
                        year_news: 'апреля 2018',
                        name_news:'Представители ООО «Компания Промэлектронсервис» приняли участие в конференции «Пути решения задач обеспечения современной радиоэлектронной аппаратуры надежной электронной компонентной базой»',
                        descr_news:'В Международной научно-технической конференции «Пути решения задач обеспечения современной радиоэлектронной аппаратуры надежной электронной компонентной базой», состоявшейся с 18 по 20 апреля в г. Санкт-Петербург, приняли участие представители ООО «Компания Промэлектронсервис». На конференции были заслушаны доклады ведущих специалистов Министерства промышленности и торговли РФ, Государственной корпорации по космической деятельности «Роскосмос», Росстандарта, Минобрнауки России,предприятий-разработчиков и изготовителей электронных компонентных баз и радиоэлектронной аппаратуры, экспертных организаций, испытательных центров.',
                    },
                    {
                        number: 26,
                        year_news: 'марта 2018',
                        name_news:'Специалисты Испытательной лаборатории ООО «Компания Промэлектронсервис» прошли обучение в АНО «Центр сертификации, обучения и консалтинга «Электронсертифика»',
                        descr_news:'Специалисты Испытательной лаборатории ООО «Компания Промэлектронсервис» с 15 по 16 марта 2018 года прошли обучение в АНО «Центр сертификации, обучения и консалтинга «Электронсертифика» по программе «Организация и проведение метрологической экспертизы проектной, конструкторской,и эксплуатационной документации. Метрологическое обеспечение средств измерений и испытательного оборудования» и получили свидетельства,подтверждающие успешное окончание обучения.',
                    }, {
                        number: 26,
                        year_news: 'марта 2018',
                        name_news:'Специалисты Испытательной лаборатории ООО «Компания Промэлектронсервис» приняли участие в конференции по программе «Развитие современных СМК предприятий"',
                        descr_news:'Специалисты Испытательной лаборатории ООО «Компания Промэлектронсервис» с 14 по 16 марта 2018 года приняли участие в конференции по программе«Развитие современных СМК предприятий по ГОСТ Р ИСО 9001-2015, дополнительным требованиям ГОСТ РВ 0015-002-2012 и АS9100D:2016.Особенности гармонизации новых требований в действующую СМК»',
                    },
                    {
                        number: 26,
                        year_news: 'марта 2018',
                        name_news:'Обучение в АНО «Центр сертификации, обучения и консалтинга «Электронсертифика»',
                        descr_news:'Представители Испытательной лаборатории ООО «Компания Промэлектронсервис» с 11 по 13 апреля 2017 года прошли обучение в АНО «Центр сертификации, обучения и консалтинга «Электронсертифика» по программе «Основные требования к испытательным лабораториям (центрам).Документирование системы качества испытательных лабораторий (центров)».При этом успешно завершили обучение и получили свидетельства подтверждающие успешное окончание обучения.',
                    },
                ],
                News2017:[
                    {
                        number: 5,
                        year_news: 'декабря 2017',
                        name_news:'Испытательная лаборатория ООО «Компания Промэлектронсервис» ввела в эксплуатацию два комплекса для электротермотренировки (ЭТТ) радиоэлектронных элементов и устройств ДМТ-145',
                        descr_news:'Испытательная лаборатория ООО «Компания Промэлектронсервис» была дополнительно оснащена комплексами для электротермотренировки и термотренировки радиоэлектронных элементов и устройств ДМТ-145, ',
                    },
                    {
                        number: 29,
                        year_news: 'ноября 2017',
                        name_news:'Cостоялась встреча в рамках технического семинара от производителя Focuslight Technologies Inc.',
                        descr_news:'Состоялся технический семинар «Высокомощные матрицы лазерных диодов для накачки твердотельных лазеров». C приглашённым докладом выступали наши партнеры из ОЭС Спецпоставка, также представители Focuslight Technologies Inc.: директор отдела производства и развития лазерных диодов- Leon Li и менеджер по продажам - Becky Huang.На семинаре также присутствовали представители отрасли и Университета ИТМО. Компания Focuslight Technologies Inc.  производит высокомощные диодные лазеры для применений в области современного производства, науки и жизни, исследований и разработок. Благодаря своему обширному инженерному опыту в области термического, оптического и механического проектирования, склеивания штампов, сборки FAC, волоконной муфты и системной интеграции Focuslight призвана предоставить клиентам хорошо подобранные комплексные решения. Семинар вызвал большой интерес.',
                    },
                    {
                        number: 16,
                        year_news: 'ноября 2017',
                        name_news:'Компания Промэлектронсервис посетила выставку Productronica 2017, которая проходила с 14 по 17 ноября в Германии',
                        descr_news:'Productronica – это ведущая мировая торговая ярмарка для разработки и производства электроники: целая цепочка создания стоимости в производстве электроники под одной крышей - от программного обеспечения до управления технологическим процессом, от технологий до приложений и от продуктов до системных решений; все ключевые игроки отрасли; последние разработки и инновации, которые дают вам представление о будущем производства электроники. По итогам поездки ведутся переговоры по заключению ряда соглашений и договоренностей с ведущими поставщиками электроники в мире.',
                    },
                    {
                        number: 5,
                        year_news: 'октября 2017',
                        name_news:'Испытательная лаборатория ООО «Компания Промэлектронсервис» ввела в эксплуатацию камеру статической и динамической пыли',
                        descr_news:'Испытательная лаборатория ООО «Компания Промэлектронсервис» была дополнительно оснащена испытательным оборудованием для проведения испытаний на воздействие статической и динамической пыли (песка) , позволяющем проводить испытания в соответствии с ГОСТ РВ 20.57.306 и ГОСТ РВ 20.57.416.',
                    },
                    {
                        number: 18,
                        year_news: 'мая 2017',
                        name_news:'Семинар по теме «Новый гособоронзаказ: что нужно знать бухгалтеру и юристу об особенностях его исполнения в 2017 г.»',
                        descr_news:'Представители ООО «Компания Промэлектронсервис» 18 мая 2017 года приняли участие в семинаре по теме «Новый гособоронзаказ: что нужно знать бухгалтеру и юристу об особенностях его исполнения в 2017 г.» проводимый ООО «Что делать Квалификация» и получили сертификаты о повышении квалификации. Программа семинара охватывала последние изменения Федерального закона о государственном оборонном заказе № 275-ФЗ, порядок его правильного применения, банковское (казначейское) сопровождение ГОЗ, банковские операции по отдельным счетам, ведение раздельного учета. Семинар освещал Гуев Алексей Николаевич – бизнес-консультант, эксперт по гражданскому праву, к. ю. н., Автор постатейных комментариев к действующим кодексам РФ.',
                    },
                    {
                        number: 8,
                        year_news: 'апреля 2017',
                        name_news:'Международная научно-техническая конференция',
                        descr_news:'Представители ООО «Компания Промэлектронсервис» приняли участие в Международной научно-технической конференции «Пути решения задач обеспечения современной радиоэлектронной аппаратуры (РЭА) надежной электронной компонентной базой (ЭКБ)» , состоявшейся 5-7 апреля в г. Санкт-Петербург. Где были заслушаны доклады ведущих специалистов Минпромторга России, Минобороны России, Роскосмоса, Росстандарта, Минобрнауки России, предприятий-разработчиков и изготовителей электронных компонентных баз и радиоэлектронной аппаратуры, экспертных организаций, испытательных центров и квалифицированных поставщиков.',
                    },
                    {
                        number: 3,
                        year_news: 'марта 2017',
                        name_news:'Испытательная лаборатория ООО «Компания Промэлектронсервис» получили аккредитацию на техническую компетентность и независимость',
                        descr_news:'Испытательная лаборатория ООО «Компания Промэлектронсервис» получили аккредитацию на техническую компетентность и независимость Центральным органом Системы «Электронсерт» с правом проведения работ в соответствии с областью аккредитации (Аттестат аккредитации № ЭС 01.061.0033-2017 от 06.03.2017г.).',
                    },

                ],
            }
        }
    }
</script>
<style>
    .tab-content {
        border: 1.5px solid #183018  !important;
        border-radius: 10px;
    }
    .nav-pills .nav-link.active {
        background-color: #3e5262 !important;
        color: white !important;
    }
    .nav-pills .nav-link {
        color: #183018 !important;
        border: 1.5px solid rgba(62, 82, 98, 0.65) !important;
        background: rgba(62, 82, 98, 0.15);
        padding: 0.2rem !important;
    }

    .b-table-sticky-header {
        max-height: 65vh !important;
    }
</style>
<style scoped lang="scss">
    #news{
        background: url("../../public/фон.jpg");
        background-size: 100% 100%;
        padding: 1% 0 2.5% 0;
    }
    .row{
        background: rgba(255, 255, 255, 0.79);
        border-bottom: 2px solid #839eb0;
        padding: 0.6%;
    }
    .number{
        font-weight: 600;
        font-size: 3.5rem;
        text-align: center;
    }
    .year_news{
        font-weight: 800 !important;
        text-align: center !important;
        margin-top: -8%;
    }
    .col-2{
        flex: 0 0 11% !important;
        max-width: 11% !important;
    }
    h3{
        padding-bottom: 0.1% !important;
        padding-top: 0.1% !important;
    }
    @media screen and (max-width: 768px) {
        .number{
            font-size: 2rem;
        }
    }
    @media screen and (min-width: 768px)and (max-width: 992px) {
        .number{
            font-size: 2.5rem;
        }
    }
    @media screen and (min-width: 992px)and (max-width: 1200px) {
        .number{
            font-size: 3rem;
        }
    }
</style>